{
  "badge": "What kind of coupon. ex: 'In-Store Only' ",
  "code": "The coupon/offer code.",
  "description": "HTML-friendly description.",
  "details": "Fine print or exclusion data.",
  "discount": "The big number on the coupon. Percentage off, etc.",
  "ends": "Date for when the event ends.",
  "eventName": "Name of coupon or event.",
  "extra": "true or false (no quotes!) -- this adds the 'EXTRA' tag at the top of the coupon.",
  "headerColor": "Classname of header color, ex: 'accent-primary' ",
  "image": "URL of image for offer or promo drawer version of coupon",
  "link": "URL for 'shop now' or 'learn more' button.",
  "upc": "UPC code that will be used to generate barcodes.",
}

ex:

{
  headerColor: "brand-belkblue",
  badge: "Online & In-Store",
  extra: true,
  discount: "15",
  eventName: "Elite Savings Event",
  code: "ELITEDAY15",
  upc: "81982086",
  ends: "Ends Thurs, 9/17 at 11:59pm ET",
  description: "Extra 15% off with Belk Rewards Elite credit card & coupon on top of today's coupon.",
  details: "<div class='coupon-exclusions-modal-header'>Offer Exclusions &amp; Restrictions</div><div class='coupon-exclusions-modal-event'>Elite Savings Event</div><div class='coupon-exclusions-modal-details'>Extra 15% off with Belk Rewards Elite credit card &amp; coupon on top of today’s coupon</div><div class='coupon-exclusions-modal-validity'>Ends Thurs, 9/17 at 11:59pm ET</div><div class='coupon-exclusions-modal-content'>*Excludes Doorbusters, Daily Deals, Weekly Spotlight, Clearance, Red Dot, Superbuys, Adidas, Alegria, Assets, baby gear, beauty department, Billabong, Birkenstock, Brahmin, Bric,’s, Brighton, Capri Candle, Champion, Chubbies, Coach, Cole Haan shoes, Columbia, Converse, Dansko, DKNY, Donald Pliner, Donna Karen apparel, Draper James, Eileen Fisher apparel and shoes, Eileen West sleepwear, Free People, Frye handbags, shoes and men’s furnishings, Habitual, Herend, Hey Dude, Hunter Boots, Hurley, Instant Pot, Jack Rogers, Johnston &amp; Murphy shoes and belts, Juliska, Kate Spade, Kitchen Electrics, Koolaburra, Lauren Ralph Lauren women’s sportswear, dresses, handbags, jewelry &amp; accessories, Le Creuset, Leegin, Levi’s, Lilly Pulitzer, Merrell, Michael Kors, Nike, Polo Ralph Lauren, Premium Toys, Puma, Quiksilver, Reef, Rhone, Roxy apparel and shoes, Sam Edelman, select designer handbags, select designer intimates, select designer sunglasses, select kitchen cookware, prep &amp; bakeware, select men’s designer basics, smart home department, smart wearables, Sorel, Spanx, Spartina, Teva apparel and shoes, Timberland, Tommy John, Tumi, UGG, Under Armour, Vince Camuto shoes, Vineyard Vines, Vionic, Vitamix, Wacoal, What Goes Around Comes Around and fine jewelry trunk shows and service plans. Not valid on prior purchases, special orders or trunk shows, select online exclusive brands and items shipped directly from vendors on belk.com or Belk gift cards. Additional brand exclusions may apply. Belk Rewards Mastercard® is issued by Synchrony Bank pursuant to a license by Mastercard International Incorporated. Mastercard is a registered trademark, and the circles design is a trademark of Mastercard International Incorporated. All Belk Rewards credit card purchases are subject to credit approval. Valid in stores and online September 14-17, 2020 until 11:59pm.</div>",
  link: "search?prefn1=couponCodes&prefv1=ELITESAVES"
}